[
  {
    "stmt": "SELECT * FROM mainApp_resena;",
    "header": [
      "id",
      "nombre_cliente",
      "email_cliente",
      "calificacion",
      "comentario",
      "aprobada",
      "fecha_creacion",
      "producto_id"
    ],
    "rows": [
      [
        "1",
        "Paulo",
        "NULL",
        "5",
        "La polera es de una calidad increíble, el algodón es suave y el estampado de Luffy es hilarante y muy nítido. Recibí muchos cumplidos usándola. ¡Súper recomendable para cualquier Mugiwara!",
        "1",
        "2025-12-01 10:34:41.852871",
        "1"
      ],
      [
        "2",
        "Sofía",
        "NULL",
        "5",
        "El diseño de Zoro es brutal. Se ve incluso mejor que en las fotos, muy bien detallado y la polera es cómoda.",
        "0",
        "2025-12-01 10:36:32.588072",
        "4"
      ],
      [
        "3",
        "Matías",
        "NULL",
        "5",
        "Me encantó el corte y el material. No solo es cómoda, sino que el diseño de Sanji tiene un toque sofisticado que se sale de lo común. El estampado se siente duradero. ¡Excelente!",
        "0",
        "2025-12-01 10:37:05.477269",
        "9"
      ],
      [
        "4",
        "Javier",
        "NULL",
        "5",
        "Polerón de gran calidad. Es súper abrigador y el diseño minimalista de Death Stranding es justo lo que buscaba. Me siento como Sam Porter Bridges. ¡Muy buen producto y llegó muy rápido!",
        "0",
        "2025-12-01 10:37:38.905527",
        "12"
      ],
      [
        "5",
        "Daniela",
        "NULL",
        "5",
        "Como fan del juego Clair Obscur, la calidad del estampado de este polerón es asombrosa, captura toda la atmósfera. Es muy suave por dentro. Valió la pena la espera!",
        "1",
        "2025-12-01 10:38:06.857061",
        "11"
      ],
      [
        "6",
        "Claudia",
        "NULL",
        "5",
        "El polerón de Hornet es genial. El color negro hace que el diseño rojo destaque muchísimo. Muy abrigador y perfecto para la espera de Silksong. La tela se siente premium.",
        "0",
        "2025-12-01 10:38:37.121938",
        "10"
      ],
      [
        "7",
        "Benjamín",
        "NULL",
        "5",
        "Una taza fuerte y robusta. El estampado de Naruto en Modo Sabio es vibrante y no se ha borrado nada después de varios lavados en lavavajillas. ¡Me da energía 'Ninja' cada mañana!",
        "1",
        "2025-12-01 10:39:07.787461",
        "15"
      ],
      [
        "8",
        "Fernanda",
        "NULL",
        "5",
        "Diseño excelente y la taza es de muy buen tamaño. La imagen de Meliodas es nítida. Ideal para cualquier fan de Los Siete Pecados Capitales.",
        "0",
        "2025-12-01 10:39:43.257684",
        "14"
      ],
      [
        "9",
        "Elisa",
        "NULL",
        "5",
        "Una taza esencial para cualquier héroe. Es resistente al microondas y el diseño de Deku me motiva a dar el 100%. Los colores son muy vivos. ¡Satisfecha con mi compra!",
        "0",
        "2025-12-01 10:40:10.575434",
        "13"
      ],
      [
        "10",
        "Isidora",
        "NULL",
        "5",
        "La polera es muy cómoda y el diseño de Luffy es demasiado gracioso. La tela no se encoge y el estampado es de calidad, se ve resistente. Perfecta para maratonear One Piece o salir a divertirse. ¡Recomendada 100%!",
        "1",
        "2025-12-01 10:41:25.668819",
        "1"
      ],
      [
        "11",
        "Ricardo",
        "NULL",
        "5",
        "Compré esta polera para un regalo y fue un éxito total. Es original, el algodón es fresco y el color blanco se mantiene brillante. Un diseño que cualquier fan de Luffy debería tener.",
        "1",
        "2025-12-01 10:41:44.444018",
        "1"
      ],
      [
        "12",
        "Vicente",
        "NULL",
        "5",
        "La mejor compra para un fan de Expedition 33. El diseño es fiel al arte del juego, súper detallado y elegante. El polerón es grueso y muy abrigador. Ideal para el invierno y para mostrar mi gusto por los RPG de calidad. ¡Llegó rapidísimo!",
        "1",
        "2025-12-01 10:42:09.133344",
        "11"
      ],
      [
        "13",
        "Gabriela",
        "NULL",
        "5",
        "Estoy impresionado con la calidad de este polerón. la lana interior es muy suave y el estampado resiste el lavado. Captura perfectamente la atmósfera dramática de Clair Obscur. ¡Cinco estrellas bien merecidas!",
        "1",
        "2025-12-01 10:42:49.482143",
        "11"
      ],
      [
        "14",
        "Sebastian",
        "NULL",
        "5",
        "Tazón grande, robusto y el diseño de Naruto en Modo Sabio me da el push de energía que necesito en las mañanas. Los colores son vibrantes y el diseño es muy nítido. ¡La mejor taza para un fan de Konoha!",
        "1",
        "2025-12-01 10:43:13.658374",
        "15"
      ],
      [
        "15",
        "Andrea",
        "NULL",
        "5",
        "Compré esta taza para mi hermano fanático de Naruto y le encantó. Llegó muy bien embalada y en perfectas condiciones. El diseño no se raya y es resistente a las bebidas calientes.",
        "1",
        "2025-12-01 10:43:30.093339",
        "15"
      ]
    ]
  }
]
